#include<stdio.h>

int main(){

	return 0;
}
/*1과 25사이의 홀수 int를 입력 받아 * - 문자로 다이아몬드 모양을 그리는 코드를 작성하라. 
1과 25사이의 홀수 int이 입력되지 않으면 계속 새로운 입력을 반복한다. 
입출력 예시를 확인하고 코드를 작성하라. (출력의 소문자 < < : 문자들을 잘 확인하자. )

//입출력 예시 1: 입력은 1, 25, 8, 3 순이고 나머지는 출력이다.
1 < odd number < 25: 1
1 < odd number < 25: 25
1 < odd number < 25: 8
1 < odd number < 25: 3
-*-
***
-*-

//입출력 예시 2: 입력은 5
1 < odd number < 25: 5
--*--
-***-
*****
-***-
--*--

//입출력 예시 3: 입력은 9
1 < odd number < 25: 9
----*----
---***---
--*****--
-*******-
*********
-*******-
--*****--
---***---
----*----

*/