#include<stdio.h>

int main(){

	return 0;
}
/*
사용자로부터 피라미드의 높이와 빈칸으로 채울 문자를 입력받아, 
해당 단의 숫자와 문자로 이루어진 피라미드를 출력하는 C 프로그램을 작성하시오. 각 단의 공백에는 단의의 숫자를 출력한다.

*높이는 최대 10으로 제한

#입력예시 1
4 @

#출력예시 1
111@111
22@@@22
3@@@@@3
@@@@@@@

#입력예시 2
4 #

#출력예시 2
111#111
22###22
3#####3
#######

#입력예시 3
10 *

#출력예시 3
111111111*111111111
22222222***22222222
3333333*****3333333
444444*******444444
55555*********55555
6666***********6666
777*************777
88***************88
9*****************9
*******************
*/